In [2]:
#pip install dash-bootstrap-components

In [2]:
import dash
import dash_bootstrap_components as dbc
import numpy as np
import pandas as pd
from dash import html , dcc , Dash
from dash.dependencies import Output, Input
import plotly.express as px

In [3]:
df=pd.read_csv(r"C:\Users\shrouk\Documents\data set\car_purchasing.csv")
print(df.head(5))

     customer name                                    customer e-mail  \
0    Martina Avila  cubilia.Curae.Phasellus@quisaccumsanconvallis.edu
1    Harlan Barnes                                eu.dolor@diam.co.uk
2  Naomi Rodriquez  vulputate.mauris.sagittis@ametconsectetueradip...
3  Jade Cunningham                            malesuada@dignissim.com
4     Cedric Leach     felis.ullamcorper.viverra@egetmollislectus.net

        country  gender        age  annual Salary  credit card debt  \
0      Bulgaria       0  41.851720    62812.09301      11609.380910
1        Belize       0  40.870623    66646.89292       9572.957136
2       Algeria       1  43.152897    53798.55112      11160.355060
3  Cook Islands       1  58.271369    79370.03798      14426.164850
4        Brazil       1  57.313749    59729.15130       5358.712177

     net worth  car purchase amount
0  238961.2505          35321.45877
1  530973.9078          45115.52566
2  638467.1773          42925.70921
3  548599.0524          67422.36313
4  560304.0671          55915.46248

In [4]:
df['gender']=df['gender'].replace([0,1],['female','male'])
print(df.head(5))

     customer name                                    customer e-mail  \
0    Martina Avila  cubilia.Curae.Phasellus@quisaccumsanconvallis.edu
1    Harlan Barnes                                eu.dolor@diam.co.uk
2  Naomi Rodriquez  vulputate.mauris.sagittis@ametconsectetueradip...
3  Jade Cunningham                            malesuada@dignissim.com
4     Cedric Leach     felis.ullamcorper.viverra@egetmollislectus.net

        country  gender        age  annual Salary  credit card debt  \
0      Bulgaria  female  41.851720    62812.09301      11609.380910
1        Belize  female  40.870623    66646.89292       9572.957136
2       Algeria    male  43.152897    53798.55112      11160.355060
3  Cook Islands    male  58.271369    79370.03798      14426.164850
4        Brazil    male  57.313749    59729.15130       5358.712177

     net worth  car purchase amount
0  238961.2505          35321.45877
1  530973.9078          45115.52566
2  638467.1773          42925.70921
3  548599.0524          67422.36313
4  560304.0671          55915.46248

In [5]:
print(df.isna().sum())

customer name          0
customer e-mail        0
country                0
gender                 0
age                    0
annual Salary          0
credit card debt       0
net worth              0
car purchase amount    0
dtype: int64

In [6]:
print(df.duplicated().sum())

0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   customer name        500 non-null    object
 1   customer e-mail      500 non-null    object
 2   country              500 non-null    object
 3   gender               500 non-null    object
 4   age                  500 non-null    float64
 5   annual Salary        500 non-null    float64
 6   credit card debt     500 non-null    float64
 7   net worth            500 non-null    float64
 8   car purchase amount  500 non-null    float64
dtypes: float64(5), object(4)
memory usage: 35.3+ KB

In [8]:
df.describe()

,age,annual Salary,credit card debt,net worth,car purchase amount
count,500.000000,500.000000,500.000000,500.000000,500.000000
mean,46.241674,62127.239608,9607.645049,431475.713625,44209.799218
std,7.978862,11703.378228,3489.187973,173536.756340,10773.178744
min,20.000000,20000.000000,100.000000,20000.000000,9000.000000
25%,40.949969,54391.977195,7397.515792,299824.195900,37629.896040
50%,46.049901,62915.497035,9655.035568,426750.120650,43997.783390
75%,51.612263,70117.862005,11798.867487,557324.478725,51254.709517
max,70.000000,100000.000000,20000.000000,1000000.000000,80000.000000

In [24]:
app= Dash(external_stylesheets=[dbc.themes.GRID])
app.layout =html.Div([
    dbc.Spinner(color="warning"),
    dbc.Row(html.Div(html.H1("Car Purchasing", style={'color': 'green' , 'text-align':'center'}))),
    dbc.Row([
        dbc.Col(html.Div([top_card = dbc.Card([
        dbc.CardImg(src="/static/images/placeholder286x180.png", top=True),
        dbc.CardBody(
        html.P("This card has an image at the top", className="card-text")),],style={"width": "18rem"},)]), width=33),

       dbc.Col(html.Div([
       dcc.Graph(figure=px.choropleth(df, 
                                   locations='country',
                                   color='annual Salary',
                                   color_continuous_scale="Viridis", 
                                   hover_name='country',
                                   hover_data=['car purchase amount'],
                                   range_color=(20000000000, 1000000000),
                                   locationmode='country names').update_layout(title={'text': 'Range of annual salary per country', 'x': 0.5}
                                  , geo = dict(showframe=False,showcoastlines=False)))]), width=9)]),

       dbc.Row([
       dbc.Col(html.Div([
            dcc.Graph(figure = px.ecdf(df, y="credit card debt",x='annual Salary', color="gender"))]), width=4)])

])

In [25]:
app.run_server(port=8060)